Step 1. Import the necessary libraries

In [16]:
import pandas as pd

Step 2. Create the 3 DataFrames based on the followin raw data

```
raw_data_1 

subject_id = ['1', '2', '3', '4', '5']
first_name = ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung']
last_name = ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']

raw_data_2 

subject_id = ['4', '5', '6', '7', '8']
first_name = ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty']
last_name = ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']

raw_data_3

subject_id = ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11']
test_id = [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]
```

In [17]:
subject_id = ['1', '2', '3', '4', '5']
first_name = ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung']
last_name = ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']
data1 = pd.DataFrame(data=list(zip(subject_id, first_name, last_name)), 
                          columns=['subject_id', 'first_name','last_name'])
print('Shape',data1.shape)

Shape (5, 3)

In [18]:
data1.head()

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

In [19]:
subject_id = ['4', '5', '6', '7', '8']
first_name = ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty']
last_name = ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']
data2 = pd.DataFrame(data=list(zip(subject_id, first_name, last_name)), 
                          columns=['subject_id', 'first_name','last_name'])
print('Shape',data2.shape)

Shape (5, 3)

In [20]:
data2.head(10)

  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [21]:
subject_id = ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11']
test_id = [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]
data3 = pd.DataFrame(data=list(zip(subject_id, test_id)), 
                          columns=['subject_id', 'test_id'])
print('Shape',data3.shape)

Shape (10, 2)

In [22]:
data3.head(10)

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

Step 4. Join the two dataframes data1 and data2 along rows and assign all_data

In [23]:
all_data = pd.concat([data1, data2])
all_data.head(10)

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

Step 5. Merge all_data and data3 along the subject_id value

In [24]:
pd.merge(all_data, data3, on='subject_id', how='left') # note how the missing subject_id 6 gets a NaN

  subject_id first_name last_name  test_id
0          1       Alex  Anderson     51.0
1          2        Amy  Ackerman     15.0
2          3      Allen       Ali     15.0
3          4      Alice      Aoni     61.0
4          5     Ayoung   Atiches     16.0
5          4      Billy    Bonder     61.0
6          5      Brian     Black     16.0
7          6       Bran   Balwner      NaN
8          7      Bryce     Brice     14.0
9          8      Betty    Btisan     15.0

In [25]:
data3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
subject_id    10 non-null object
test_id       10 non-null int64
dtypes: int64(1), object(1)
memory usage: 240.0+ bytes

In [26]:
all_data.info() # so the merge wasn't saved, but of course we can save it

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10 entries, 0 to 4
Data columns (total 3 columns):
subject_id    10 non-null object
first_name    10 non-null object
last_name     10 non-null object
dtypes: object(3)
memory usage: 320.0+ bytes

Step 6. Merge only the data that has the same 'subject_id' on both data1 and data2Â¶

In [27]:
pd.merge(data1, data2, on='subject_id', how='inner')

  subject_id first_name_x last_name_x first_name_y last_name_y
0          4        Alice        Aoni        Billy      Bonder
1          5       Ayoung     Atiches        Brian       Black

Step 7. Merge all values in data1 and data2, with matching records from both sides where available.

In [28]:
pd.merge(data1, data2, on='subject_id', how='outer')

  subject_id first_name_x last_name_x first_name_y last_name_y
0          1         Alex    Anderson          NaN         NaN
1          2          Amy    Ackerman          NaN         NaN
2          3        Allen         Ali          NaN         NaN
3          4        Alice        Aoni        Billy      Bonder
4          5       Ayoung     Atiches        Brian       Black
5          6          NaN         NaN         Bran     Balwner
6          7          NaN         NaN        Bryce       Brice
7          8          NaN         NaN        Betty      Btisan

In [30]:
pd.merge(data1, data2, on=['subject_id','first_name']) # using defaults we get no match

Empty DataFrame
Columns: [subject_id, first_name, last_name_x, last_name_y]
Index: []

In [48]:
# here I am experimenting with merge to test the above defaults. What is "amy" appears in the two dataframes 
# and the subject matches too? Let's add another Amy with a subject 4 (no match) and one with 2 (match with data1)

temp_data = {'subject_id': ['2', '4', '5'], 'first_name': ['Amy', 'Amy', 'Rick']}
data2temp = pd.concat([data2, pd.DataFrame(data=temp_data)])
data2temp.head(10)

  first_name last_name subject_id
0      Billy    Bonder          4
1      Brian     Black          5
2       Bran   Balwner          6
3      Bryce     Brice          7
4      Betty    Btisan          8
0        Amy       NaN          2
1        Amy       NaN          4
2       Rick       NaN          5

In [49]:
pd.merge(data1, data2temp, on=['subject_id','first_name']) # shows one row where subject and first_name match

  subject_id first_name last_name_x last_name_y
0          2        Amy    Ackerman         NaN

In [50]:
data1.head()

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

In [51]:
data1.merge(data2temp, left_on='subject_id', right_on='subject_id', how='left') # useful when col names are different
# in this case they aren't, but just demonstrating the usage

  subject_id first_name_x last_name_x first_name_y last_name_y
0          1         Alex    Anderson          NaN         NaN
1          2          Amy    Ackerman          Amy         NaN
2          3        Allen         Ali          NaN         NaN
3          4        Alice        Aoni        Billy      Bonder
4          4        Alice        Aoni          Amy         NaN
5          5       Ayoung     Atiches        Brian       Black
6          5       Ayoung     Atiches         Rick         NaN

In [52]:
data1.merge(data2temp, on=['first_name'], how='left')

  subject_id_x first_name last_name_x last_name_y subject_id_y
0            1       Alex    Anderson         NaN          NaN
1            2        Amy    Ackerman         NaN            2
2            2        Amy    Ackerman         NaN            4
3            3      Allen         Ali         NaN          NaN
4            4      Alice        Aoni         NaN          NaN
5            5     Ayoung     Atiches         NaN          NaN

In [53]:
data1.merge(data2temp, on=['subject_id'], how='left')

  subject_id first_name_x last_name_x first_name_y last_name_y
0          1         Alex    Anderson          NaN         NaN
1          2          Amy    Ackerman          Amy         NaN
2          3        Allen         Ali          NaN         NaN
3          4        Alice        Aoni        Billy      Bonder
4          4        Alice        Aoni          Amy         NaN
5          5       Ayoung     Atiches        Brian       Black
6          5       Ayoung     Atiches         Rick         NaN